local Translations = {
    error = {
        not_online = 'Ø§Ù„Ù„Ø§Ø¹Ø¨ ØºÙŠØ± Ù…ØªØµÙ„',
        wrong_format = 'Ø§Ù„ØªÙ†Ø³ÙŠÙ‚ ØºÙŠØ± ØµØ­ÙŠØ­',
        missing_args = '(x, y, z) Ù„Ù… ÙŠØªÙ… Ø§Ø¯Ø®Ù„ Ø¬Ù…ÙŠØ¹ Ø§Ù„Ù…Ø¹Ù„ÙˆÙ…Ø§Øª',
        missing_args2 = 'ÙŠØ¬Ø¨ Ù…Ù„Ø£ Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø­Ù‚ÙˆÙ„ Ø§Ù„Ù„Ø§Ø²Ù…Ø©',
        no_access = 'Ù„Ø§ ÙŠÙ…ÙƒÙ† Ø§Ù„ÙˆØµÙˆÙ„ Ø¥Ù„Ù‰ Ù‡Ø°Ø§ Ø§Ù„Ø£Ù…Ø±',
        company_too_poor = 'Ù…Ø³Ø¤ÙˆÙ„ Ø§Ù„ÙˆØ¸ÙŠÙØ© Ù„Ø§ ÙŠÙ…ÙƒÙ„Ùƒ Ù…Ø§Ù„ ÙƒØ§ÙÙŠ',
        item_not_exist = 'Ø¹Ù†ØµØ± ØºÙŠØ± Ù…ÙˆØ¬ÙˆØ¯',
        too_heavy = 'Ù„Ø§ ÙŠÙˆØ¬Ø¯ Ù…Ø³Ø§Ø­Ø© ÙÙŠ Ø¬Ù‚ÙŠØ¨ØªÙƒ',
		location_not_exist = 'Ø§Ù„Ù…ÙˆÙ‚Ø¹ ØºÙŠØ± Ù…ÙˆØ¬ÙˆØ¯',
        job_not_exist               = 'Job does not exist',
        gang_not_exist              = 'Gang does not exist',
        duplicate_license = 'ÙˆØ¬Ø¯Ù†Ø§ ØªØ±Ø®ÙŠØµ Ø±ÙˆÙƒØ³ØªØ§Ø± Ù…ÙƒØ±Ø± Ø§Ùˆ Ù…ÙˆØ¬ÙˆØ¯ Ù…Ø³Ø¨Ù‚Ø§',
        no_valid_license  = 'ØªØ±Ø®ÙŠØµ Ø±ÙˆÙƒØ³ØªØ§Ø± ØºÙŠØ± ØµØ­ÙŠØ­',
        not_whitelisted = 'Ø¹Ø¶ÙˆÙŠØªÙƒ ØºÙŠØ± Ù…ÙØ¹Ù„Ø© ÙÙŠ Ù‡Ø°Ø§ Ø§Ù„Ø³ÙŠØ±ÙØ±',
		server_already_open = 'Ø§Ù„Ø³ÙŠØ±ÙØ± Ù…ÙØªÙˆÙˆØ­',
        server_already_closed = 'Ø§Ù„Ø³ÙŠØ±ÙØ± Ù…ØºÙ„Ù‚',
        no_permission = 'Ù„Ø§ØªÙ…ØªÙ„Ùƒ Ø§Ù„ØµÙ„Ø§Ø­ÙŠØ©',
        no_waypoint = 'Ù„Ù… ÙŠØªÙ… ØªØ­Ø¯ÙŠØ¯ Ø§Ù„Ø§ØªØ¬Ø§Ù‡.',
        tp_error = 'Ø®Ø·Ø£ Ø§Ø«Ù†Ø§Ø¡ Ø§Ù„Ø§Ù†ØªÙ‚Ø§Ù„.',
    },
	success = {
        server_opened = 'ØªÙ… ÙØªØ­ Ø§Ù„Ø³ÙŠØ±ÙØ±',
        server_closed = 'ØªÙ… ØºÙ„Ù‚ Ø§Ù„Ø³ÙŠØ±ÙØ±',
        teleported_waypoint = 'ØªÙ… Ø§Ù„Ø§Ù†ØªÙ‚Ø§Ù„ Ø§Ù„ÙŠ Ø§Ù„Ø§ØªØ¬Ø§Ù‡ Ø§Ù„Ù…Ø­Ø¯Ø¯.',
        job_set = 'Job set successfully',
        gang_set = 'Gang set successfully',
    },
    info = {
        received_paycheck = '$%{value} Ù„Ù‚Ø¯ Ø§Ø³ØªÙ…Ù„Øª Ø±Ø§ØªØ¨Ùƒ Ø§Ù„Ø´Ù‡Ø±ÙŠ',
        job_info = '%{value} | %{value2} | %{value3}',
        gang_info = '%{value} | %{value2}',
        on_duty = 'Ø§Ù†Øª Ø§Ù„Ø§Ù† ÙÙŠ Ø§Ù„Ø®Ø¯Ù…Ø©',
        off_duty = 'Ø§Ù†Øª Ø§Ù„Ø§Ù† Ø®Ø§Ø±Ø¬ Ø§Ù„Ø®Ø¯Ù…Ø©',
        checking_ban = 'Ù†Ø­Ù† Ù†ØªØ­Ù‚Ù‚ Ø§Ø°Ø§ ÙƒÙ†Øª Ù…Ø­Ø¬ÙˆØ¨ Ù…Ù† Ø§Ù„Ø³ÙŠØ±ÙØ±. %s Ù…Ø±Ø­Ø¨Ø§',
        join_server = '{Server Name} ÙÙŠ %s Ù…Ø±Ø­Ø¨Ø§',
        checking_whitelisted = 'Ù†ØªØ­Ù‚Ù‚ Ù…Ø§ Ø§Ø°Ø§ ÙƒØ§Ù† Ù…Ø³Ù…ÙˆØ­ Ù„Ùƒ Ø¨Ø§Ù„Ø¯Ø®ÙˆÙ„ %s Ù…Ø±Ø­Ø¨Ø§',
        exploit_banned = 'Ù„Ù‚Ø¯ ØªÙ… Ø­Ø¬Ø¨Ùƒ Ù…Ù† Ø§Ù„Ø³ÙŠØ±ÙØ± Ø¨Ø³Ø¨Ø¨ Ø§Ù„ØºØ´ Ø§Ù† ÙƒØ§Ù†Øª Ù„Ø¯ÙŠÙƒ Ø§ÙŠØ© ØªØ³Ø§Ø¤Ù„Ø§Øª Ø§ØªØµÙ„ Ø¨Ù†Ø§ Ø¹Ø¨Ø± Ø¯ÙŠØ³ÙƒÙˆØ±Ø¯ Ø§Ù„Ø³ÙŠØ±ÙØ±: %{discord}',
        exploit_dropped = 'Ù„Ù‚Ø¯ ØªÙ… Ø·Ø±Ø¯Ùƒ Ù…Ù† Ø§Ù„Ø³ÙŠØ±ÙØ± Ø¨Ø³Ø¨Ø¨ Ø§Ø³ØªØºÙ„Ø§Ù„Ùƒ Ø¨Ø¹Ø¶ Ø§Ù„Ø«ØºØ±Ø§Øª',
    },
	command = {
        tp = {
            help = 'Ø§Ù„Ø§Ù†ØªÙ‚Ø§Ù„ Ø§Ù„ÙŠ Ù†Ù‚Ø·Ø© Ø§Ùˆ Ø¥Ù„Ù‰ Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                x = { name = 'id/x', help = 'Ø§ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨ Ø§Ùˆ Ù‚ÙŠÙ…Ø© x'},
                y = { name = 'y', help = 'Y Ø§Ù„Ù‚ÙŠÙ…Ø©'},
                z = { name = 'z', help = 'Z Ø§Ù„Ù‚ÙŠÙ…Ø©'},
            },
        },
        tpm = { help = 'Ø§Ù„Ø§Ù†ØªÙ‚Ø§Ù„ Ø§Ù„ÙŠ Ø§Ù„Ù†Ù‚Ø·Ø© Ø§Ù„Ù…Ø­Ø¯Ø¯Ø© (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)' },
        togglepvp = { help = 'ØªØ¨Ø¯ÙŠÙ„ ÙˆØ¶Ø¹ PVP ÙÙŠ Ø§Ù„Ø³ÙŠØ±ÙØ± (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)' },
        addpermission = {
            help = 'Ø¥Ø¹Ø·Ø§Ø¡ ØµÙ„Ø§Ø­ÙŠØ© Ù„Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© Ø¹Ù„ÙŠØ§)',
            params = {
                id = { name = 'id', help = 'Ø¢ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨' },
                permission = { name = 'permission', help = 'Ù…Ø³ØªÙˆÙ‰ Ø§Ù„ØµÙ„Ø§Ø­ÙŠØ© Ø§Ùˆ Ø§Ù„Ø±ØªØ¨Ø©' },
            },
        },
        removepermission = {
            help = 'Ø³Ø­Ø¨ ØµÙ„Ø§Ø­ÙŠØ© Ù…Ù† Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© Ø¹Ù„ÙŠØ§)',
            params = {
                id = { name = 'id', help = 'Ø¢ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨' },
                permission = { name = 'permission', help = 'Ù…Ø³ØªÙˆÙ‰ Ø§Ù„ØµÙ„Ø§Ø­ÙŠØ© Ø§Ùˆ Ø§Ù„Ø±ØªØ¨Ø©' },
            },
        },
        openserver = { help = 'Ø¬Ø¹Ù„ Ø§Ù„Ø³ÙŠØ±ÙØ± Ù…ÙØªØ­ Ù„Ù„ÙƒÙ„ (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)' },
        closeserver = {
            help = 'Ø¥ØºÙ„Ø§Ù‚ Ø§Ù„Ø³ÙŠØ±ÙØ± Ø¨Ø§Ù„Ù†Ø³Ø¨Ø© Ù„Ù„Ø§Ø´Ø®Ø§Øµ Ø§Ù„Ø°ÙŠÙ† Ù„ÙŠØ³Øª Ù„Ø¯ÙŠÙ‡Ù… Ø§ÙŠØ© ØµÙ„Ø§Ø­ÙŠØ© (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                reason = { name = 'reason', help = 'Ø³Ø¨Ø¨ Ø§Ù„ØºÙ„Ù‚ (Ø¥Ø®ØªÙŠØ§Ø±ÙŠ)' },
            },
        },
        car = {
            help = 'Ø±Ø³Ø¨Ù†Ø© Ø³ÙŠØ§Ø±Ø© (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                model = { name = 'model', help = 'Ø§Ø³Ù… Ù…ÙˆØ¯ÙŠÙ„ Ø§Ù„Ø³ÙŠØ§Ø±Ø©' },
            },
        },
        dv = { help = 'Ø­Ø°Ù Ø§Ù„Ø³ÙŠØ§Ø±Ø© (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)' },
        givemoney = {
            help = 'Ø§Ø¶Ø§ÙØ© Ø£Ù…ÙˆØ§Ù„ Ù„Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                id = { name = 'id', help = 'Ø¢ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨' },
                moneytype = { name = 'moneytype', help = 'Ù†ÙˆØ¹ Ø§Ù„Ù…Ø§Ù„ (cash, bank, crypto)' },
                amount = { name = 'amount', help = 'Ù‚ÙŠÙ…Ø© Ø§Ù„Ù…Ø§Ù„' },
            },
        },
        setmoney = {
            help = 'ØªØ¹ÙŠÙŠÙ† Ø§Ù„Ù…Ø¨Ù„Øº Ø§Ù„Ù…Ø§Ù„ÙŠ Ù„Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                id = { name = 'id', help = 'Ø¢ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨' },
                moneytype = { name = 'moneytype', help = 'Ù†ÙˆØ¹ Ø§Ù„Ù…Ø§Ù„ (cash, bank, crypto)' },
                amount = { name = 'amount', help = 'Ù‚ÙŠÙ…Ø© Ø§Ù„Ù…Ø§Ù„' },
            },
        },
        job = { help = 'Ø§Ù„ØªØ­Ù‚Ù‚ Ù…Ù† Ø§Ù„ÙˆØ¸ÙŠÙØ©' },
        setjob = {
            help = 'Ø§Ø¹Ø·Ø§Ø¡ ÙˆØ¸ÙŠÙØ© Ù„Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                id = { name = 'id', help = 'Ø§ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨' },
                job = { name = 'job', help = 'Ø§Ø³Ù… Ø§Ù„ÙˆØ¸ÙŠÙØ©' },
                grade = { name = 'grade', help = 'Ø±ØªØ¨Ø© Ø§Ù„ÙˆØ¸ÙŠÙØ©' },
            },
        },
        gang = { help = 'Ø§Ù„ØªØ­Ù‚Ù‚ Ù…Ù† Ø§Ù„Ø¹ØµØ§Ø¨Ø©' },
        setgang = {
            help = 'Ø§Ø¹Ø·Ø§Ø¡ Ø¹ØµØ§Ø¨Ø© Ù„Ù„Ø§Ø¹Ø¨ (Ø¥Ø¯Ø§Ø±Ø© ÙÙ‚Ø·)',
            params = {
                id = { name = 'id', help = 'Ø§ÙŠØ¯ÙŠ Ø§Ù„Ù„Ø§Ø¹Ø¨' },
                gang = { name = 'gang', help = 'Ø§Ø³Ù… Ø§Ù„Ø¹ØµØ§Ø¨Ø©' },
                grade = { name = 'grade', help = 'Ø±ØªØ¨Ø© Ø§Ù„Ø¹ØµØ§Ø¨Ø©' },
            },
        },
        ooc = { help = 'OOC Ø±Ø³Ø§Ø¦Ù„ Ø®Ø§Ø±Ø¬ Ø§Ù„Ø±ÙˆÙ„ Ø¨Ù„Ø§ÙŠ' },
        me = {
            help = 'Ø§Ø¸Ù‡Ø§Ø± Ø§Ù„Ø±Ø³Ø§Ø¦Ù„',
            params = {
                message = { name = 'message', help = 'Ø§Ù„Ø±Ø³Ø§Ù„Ø©' }
            },
        },
    },
}

if GetConvar('qb_locale', 'en') == 'ar' then
    Lang = Locale:new({
        phrases = Translations,
        warnOnMissing = true,
        fallbackLang = Lang,
    })
end
