local Translations = {
    error = {
        not_online = 'à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™à¹„à¸¡à¹ˆà¸­à¸­à¸™à¹„à¸¥à¸™à¹Œ',
        wrong_format = 'à¸£à¸¹à¸›à¹à¸šà¸šà¹„à¸¡à¹ˆà¸–à¸¹à¸à¸•à¹‰à¸­à¸‡',
        missing_args = 'à¸•à¸±à¸§à¹à¸›à¸£à¸—à¸µà¹ˆà¸•à¹‰à¸­à¸‡à¸à¸²à¸£à¹„à¸¡à¹ˆà¸–à¸¹à¸à¸à¸³à¸«à¸™à¸” (x, y, z)',
        missing_args2 = 'à¸•à¹‰à¸­à¸‡à¸à¸³à¸«à¸™à¸”à¸•à¸±à¸§à¹à¸›à¸£à¸—à¸¸à¸à¸•à¸±à¸§à¹ƒà¸«à¹‰à¸„à¸£à¸š!',
        no_access = 'à¹„à¸¡à¹ˆà¸ªà¸²à¸¡à¸²à¸£à¸–à¹€à¸‚à¹‰à¸²à¸–à¸¶à¸‡à¸„à¸³à¸ªà¸±à¹ˆà¸‡à¸™à¸µà¹‰à¹„à¸”à¹‰',
        company_too_poor = 'à¸šà¸£à¸´à¸©à¸±à¸—à¸‚à¸­à¸‡à¸„à¸¸à¸“à¸à¸³à¸¥à¸±à¸‡à¸ˆà¸°à¸¥à¹‰à¸¡à¸¥à¸°à¸¥à¸²à¸¢',
        item_not_exist = 'à¹„à¸¡à¹ˆà¸¡à¸µà¹„à¸­à¹€à¸—à¸¡à¸™à¸µà¹‰',
        too_heavy = 'à¸à¸£à¸°à¹€à¸›à¹‹à¸²à¹€à¸•à¹‡à¸¡à¹à¸¥à¹‰à¸§',
        location_not_exist = 'à¹„à¸¡à¹ˆà¸¡à¸µà¸•à¸³à¹à¸«à¸™à¹ˆà¸‡à¸™à¸µà¹‰',
        job_not_exist               = 'Job does not exist',
        gang_not_exist              = 'Gang does not exist',
        duplicate_license = 'à¸žà¸šà¹ƒà¸šà¸­à¸™à¸¸à¸à¸²à¸• Rockstar à¸‹à¹‰à¸³',
        no_valid_license  = 'à¹„à¸¡à¹ˆà¸žà¸šà¹ƒà¸šà¸­à¸™à¸¸à¸à¸²à¸• Rockstar à¸—à¸µà¹ˆà¸–à¸¹à¸à¸•à¹‰à¸­à¸‡',
        not_whitelisted = 'à¸„à¸¸à¸“à¹„à¸¡à¹ˆà¹„à¸”à¹‰à¸£à¸±à¸šà¸­à¸™à¸¸à¸à¸²à¸•à¹ƒà¸«à¹‰à¹€à¸‚à¹‰à¸²à¹ƒà¸Šà¹‰à¹€à¸‹à¸´à¸£à¹Œà¸Ÿà¹€à¸§à¸­à¸£à¹Œà¸™à¸µà¹‰',
        server_already_open = 'à¹€à¸‹à¸´à¸£à¹Œà¸Ÿà¹€à¸§à¸­à¸£à¹Œà¸–à¸¹à¸à¹€à¸›à¸´à¸”à¹à¸¥à¹‰à¸§',
        server_already_closed = 'à¹€à¸‹à¸´à¸£à¹Œà¸Ÿà¹€à¸§à¸­à¸£à¹Œà¸–à¸¹à¸à¸›à¸´à¸”à¹à¸¥à¹‰à¸§',
        no_permission = 'à¸„à¸¸à¸“à¹„à¸¡à¹ˆà¹„à¸”à¹‰à¸£à¸±à¸šà¸ªà¸´à¸—à¸˜à¸´à¹Œà¹ƒà¸™à¸à¸²à¸£à¹ƒà¸Šà¹‰à¸„à¸³à¸ªà¸±à¹ˆà¸‡à¸™à¸µà¹‰..',
        no_waypoint = 'à¹„à¸¡à¹ˆà¸¡à¸µà¸ˆà¸¸à¸”à¹€à¸ªà¹‰à¸™à¸—à¸²à¸‡à¸—à¸µà¹ˆà¸•à¸±à¹‰à¸‡',
        tp_error = 'à¸‚à¹‰à¸­à¸œà¸´à¸”à¸žà¸¥à¸²à¸”à¸‚à¸“à¸°à¸§à¸²à¸£à¹Œà¸›',
        connecting_database_error = 'à¹€à¸à¸´à¸”à¸‚à¹‰à¸­à¸œà¸´à¸”à¸žà¸¥à¸²à¸”à¹ƒà¸™à¸à¸²à¸£à¹€à¸Šà¸·à¹ˆà¸­à¸¡à¸•à¹ˆà¸­à¸à¸±à¸šà¹€à¸‹à¸´à¸£à¹Œà¸Ÿà¹€à¸§à¸­à¸£à¹Œ (SQL server à¹€à¸›à¸´à¸”à¸­à¸¢à¸¹à¹ˆà¹„à¸«à¸¡?)',
        connecting_database_timeout = 'à¹€à¸Šà¸·à¹ˆà¸­à¸¡à¸•à¹ˆà¸­à¸à¸±à¸šà¸à¸²à¸™à¸‚à¹‰à¸­à¸¡à¸¹à¸¥à¹€à¸à¸´à¸” timeout (SQL server à¹€à¸›à¸´à¸”à¸­à¸¢à¸¹à¹ˆà¹„à¸«à¸¡?'
    },
    success = {
        server_opened = 'à¹€à¸‹à¸´à¸Ÿà¹€à¸§à¸­à¸£à¹Œà¹€à¸›à¸´à¸”à¹à¸¥à¹‰à¸§',
        server_closed = 'à¹€à¸‹à¸´à¸Ÿà¹€à¸§à¸­à¸£à¹Œà¹€à¸›à¸´à¸”à¹à¸¥à¹‰à¸§',
        teleported_waypoint = 'à¹€à¸„à¸¥à¸·à¸­à¸™à¸¢à¹‰à¸²à¸¢à¹„à¸›à¸¢à¸±à¸‡à¸ˆà¸¸à¸”à¸«à¸¡à¸²à¸¢.',
        job_set = 'Job set successfully',
        gang_set = 'Gang set successfully',
    },
    info = {
        received_paycheck = 'à¸„à¸¸à¸“à¹„à¸”à¹‰à¸£à¸±à¸šà¹€à¸‡à¸´à¸™à¹€à¸”à¸·à¸­à¸™ $%{value}',
        job_info = 'à¸­à¸²à¸Šà¸µà¸ž: %{value} | à¸£à¸°à¸”à¸±à¸š: %{value2} | à¸à¸³à¸¥à¸±à¸‡à¸›à¸à¸´à¸šà¸±à¸•à¸´à¸«à¸™à¹‰à¸²à¸—à¸µà¹ˆ: %{value3}',
        gang_info = 'à¹à¸à¹Šà¸‡: %{value} | à¸£à¸°à¸”à¸±à¸š: %{value2}',
        on_duty = 'à¸„à¸¸à¸“à¹€à¸£à¸´à¹ˆà¸¡à¸›à¸à¸´à¸šà¸±à¸•à¸´à¸«à¸™à¹‰à¸²à¸—à¸µà¹ˆà¹à¸¥à¹‰à¸§!',
        off_duty = 'à¸„à¸¸à¸“à¸­à¸­à¸à¸ˆà¸²à¸à¸à¸²à¸£à¸›à¸à¸´à¸šà¸±à¸•à¸´à¸«à¸™à¹‰à¸²à¸—à¸µà¹ˆà¹à¸¥à¹‰à¸§!',
        checking_ban = 'à¸ªà¸§à¸±à¸ªà¸”à¸µ %s. à¹€à¸£à¸²à¸à¸³à¸¥à¸±à¸‡à¸•à¸£à¸§à¸ˆà¸ªà¸­à¸šà¸ªà¸–à¸²à¸™à¸°à¸à¸²à¸£à¹‚à¸”à¸™à¹à¸šà¸™à¸‚à¸­à¸‡à¸„à¸¸à¸“.',
        join_server = 'à¸¢à¸´à¸™à¸”à¸µà¸•à¹‰à¸­à¸™à¸£à¸±à¸š %s à¹€à¸‚à¹‰à¸²à¸ªà¸¹à¹ˆ {Server Name}.',
        checking_whitelisted = 'à¸ªà¸±à¸§à¸ªà¸”à¸µ %s. à¹€à¸£à¸²à¸à¸³à¸¥à¸±à¸‡à¹€à¸Šà¹‡à¸„ whitelisted à¸‚à¸­à¸‡à¸„à¸¸à¸“.',
        exploit_banned = 'à¸„à¸¸à¸“à¹‚à¸”à¸™à¹à¸šà¸™à¸ˆà¸²à¸à¸à¸²à¸£à¹‚à¸à¸‡. à¹€à¸‚à¹‰à¸²à¸£à¹ˆà¸§à¸¡ Discord à¸ªà¸³à¸«à¸£à¸±à¸šà¸‚à¹‰à¸­à¸¡à¸¹à¸¥à¹€à¸žà¸´à¹ˆà¸¡à¹€à¸•à¸´à¸¡: %{discord}',
        exploit_dropped = 'à¸„à¸¸à¸“à¹‚à¸”à¸™à¹€à¸•à¸°à¸­à¸­à¸à¸ˆà¸²à¸à¹€à¸‹à¸´à¸Ÿà¹€à¸§à¸­à¸£à¹Œ à¹€à¸™à¸·à¹ˆà¸­à¸‡à¸ˆà¸²à¸à¹€à¸«à¸•à¸¸à¸œà¸¥à¹€à¸à¸µà¹ˆà¸¢à¸§à¸à¸±à¸šà¸à¸²à¸£à¹ƒà¸Šà¹‰à¹‚à¸›à¸£à¹à¸à¸£à¸¡à¹‚à¸à¸‡',
    },
    command = {
        tp = {
            help = 'à¹€à¸„à¸¥à¸·à¸­à¸™à¸¢à¹‰à¸²à¸¢à¹„à¸›à¸¢à¸±à¸‡ à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ à¸«à¸£à¸·à¸­ à¸•à¸³à¹à¸«à¸™à¹ˆà¸‡à¸žà¸´à¸à¸±à¸” (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                x = { name = 'id/x', help = 'à¹„à¸­à¸”à¸µà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ à¸«à¸£à¸·à¸­ à¸žà¸´à¸à¸±à¸” x'},
                y = { name = 'y', help = 'à¸žà¸´à¸à¸±à¸” y'},
                z = { name = 'z', help = 'à¸žà¸´à¸à¸±à¸” z'},
            },
        },
        tpm = { help = 'à¹€à¸„à¸¥à¸·à¸­à¸™à¸¢à¹‰à¸²à¸¢à¹„à¸›à¸šà¸±à¸‡à¸ˆà¸¸à¸”à¸¡à¸²à¸£à¹Œà¸„ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)' },
        togglepvp = { help = 'à¹€à¸›à¸´à¸”à¹ƒà¸Šà¹‰ pvp à¹ƒà¸™à¹€à¸‹à¸´à¸Ÿà¹€à¸§à¸­à¸£à¹Œ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)' },
        addpermission = {
            help = 'à¹ƒà¸«à¹‰à¸ªà¸´à¸—à¸˜à¸´à¹Œà¸à¸±à¸šà¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š God)',
            params = {
                id = { name = 'id', help = 'à¹„à¸­à¸”à¸µà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™' },
                permission = { name = 'permission', help = 'à¸£à¸°à¸”à¸±à¸šà¸‚à¸­à¸‡à¸ªà¸´à¸—à¸˜à¸´à¹Œ' },
            },
        },
        removepermission = {
            help = 'à¸¥à¸šà¸ªà¸´à¸—à¸˜à¸´à¹Œà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š God)',
            params = {
                id = { name = 'id', help = 'ID of player' },
                permission = { name = 'permission', help = 'à¸£à¸°à¸”à¸±à¸šà¸‚à¸­à¸‡à¸ªà¸´à¸—à¸˜à¸´à¹Œ' },
            },
        },
        openserver = { help = 'à¹€à¸›à¸´à¸”à¹€à¸‹à¸´à¸Ÿà¹€à¸§à¸­à¸£à¹Œà¸ªà¸³à¸«à¸£à¸±à¸šà¸—à¸¸à¸à¸„à¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)' },
        closeserver = {
            help = 'à¸›à¸´à¸”à¹€à¸‹à¸´à¸Ÿà¹€à¸§à¸­à¸£à¹Œà¸ªà¸³à¸«à¸£à¸±à¸šà¸—à¸¸à¸à¸„à¸™à¸—à¸µà¹ˆà¹„à¸¡à¹ˆà¸¡à¸µà¸ªà¸´à¸—à¸˜à¸´à¹Œà¸à¸²à¸£à¹€à¸‚à¹‰à¸²à¸–à¸¶à¸‡ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                reason = { name = 'reason', help = 'à¹€à¸«à¸•à¸¸à¸œà¸¥à¸—à¸µà¹ˆà¸›à¸´à¸” (à¸–à¹‰à¸²à¸¡à¸µ)' },
            },
        },
        car = {
            help = 'à¹€à¸£à¸µà¸¢à¸à¸¢à¸²à¸™à¸žà¸²à¸«à¸™à¸° (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                model = { name = 'model', help = 'à¸Šà¸·à¹ˆà¸­à¸‚à¸­à¸‡à¸¢à¸²à¸™à¸žà¸²à¸«à¸™à¸°' },
            },
        },
        dv = { help = 'à¸¥à¸šà¸¢à¸²à¸™à¸žà¸²à¸«à¸™à¸° (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)' },
        givemoney = {
            help = 'à¹ƒà¸«à¹‰à¹€à¸‡à¸´à¸™à¸à¸±à¸šà¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                id = { name = 'id', help = 'à¹„à¸­à¸”à¸µà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™' },
                moneytype = { name = 'moneytype', help = 'à¸›à¸£à¸°à¹€à¸ à¸—à¸‚à¸­à¸‡à¹€à¸‡à¸´à¸™ (à¹€à¸‡à¸´à¸™à¸ªà¸”, à¹€à¸‡à¸´à¸™à¸à¸²à¸, à¸„à¸£à¸´à¸›à¹‚à¸•)' },
                amount = { name = 'amount', help = 'à¸ˆà¸³à¸™à¸§à¸™à¹€à¸‡à¸´à¸™' },
            },
        },
        setmoney = {
            help = 'à¸à¸³à¸«à¸™à¸”à¸ˆà¸³à¸™à¸§à¸™à¹€à¸‡à¸´à¸™à¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                id = { name = 'id', help = 'à¹„à¸­à¸”à¸µà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™' },
                moneytype = { name = 'moneytype', help = 'à¸›à¸£à¸°à¹€à¸ à¸—à¸‚à¸­à¸‡à¹€à¸‡à¸´à¸™ (à¹€à¸‡à¸´à¸™à¸ªà¸”, à¹€à¸‡à¸´à¸™à¸à¸²à¸, à¸„à¸£à¸´à¸›à¹‚à¸•)' },
                amount = { name = 'amount', help = 'à¸ˆà¸³à¸™à¸§à¸™à¹€à¸‡à¸´à¸™' },
            },
        },
        job = { help = 'à¸•à¸£à¸§à¸ˆà¸ªà¸­à¸šà¸­à¸²à¸Šà¸µà¸žà¸‚à¸­à¸‡à¸„à¸¸à¸“' },
        setjob = {
            help = 'à¸à¸³à¸«à¸™à¸”à¸­à¸²à¸Šà¸µà¸žà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                id = { name = 'id', help = 'à¹„à¸­à¸”à¸µà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™' },
                job = { name = 'job', help = 'à¸Šà¸·à¹ˆà¸­à¸­à¸²à¸Šà¸µà¸žà¹ˆ' },
                grade = { name = 'grade', help = 'à¸£à¸°à¸”à¸±à¸š' },
            },
        },
        gang = { help = 'à¸•à¸£à¸§à¸ˆà¸ªà¸­à¸šà¹à¸à¹Šà¸‡à¸‚à¸­à¸‡à¸„à¸¸à¸“' },
        setgang = {
            help = 'à¸à¸³à¸«à¸™à¸”à¹à¸à¹Šà¸‡à¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™ (à¸ªà¸³à¸«à¸£à¸±à¸š Admin)',
            params = {
                id = { name = 'id', help = 'à¹„à¸­à¸”à¸µà¸‚à¸­à¸‡à¸œà¸¹à¹‰à¹€à¸¥à¹ˆà¸™' },
                gang = { name = 'gang', help = 'à¸Šà¸·à¹ˆà¸­à¹à¸à¹Šà¸‡' },
                grade = { name = 'grade', help = 'à¸£à¸°à¸”à¸±à¸š' },
            },
        },
        ooc = { help = 'à¸‚à¹‰à¸­à¸„à¸§à¸²à¸¡ OOC' },
        me = {
            help = 'à¹à¸ªà¸”à¸‡à¸‚à¹‰à¸­à¸„à¸§à¸²à¸¡à¹ƒà¸à¸¥à¹‰à¹€à¸‚à¸µà¸¢à¸‡',
            params = {
                message = { name = 'message', help = 'à¸‚à¹‰à¸­à¸„à¸§à¸²à¸¡à¸—à¸µà¹ˆà¸ˆà¸°à¸ªà¹ˆà¸‡' }
            },
        },
    }
}
    
if GetConvar('qb_locale', 'en') == 'th' then
    Lang = Locale:new({
        phrases = Translations,
        warnOnMissing = true,
        fallbackLang = Lang,
    })
end
